import pandas as pd
x=pd.Series([1,2,3])
x

# Missing values in pandas

In [5]:
data1={'Odisha':17,'Bengal':15}
data2={'Odisha':4,'Delhi':7}
d1=pd.Series(data1)
d2=pd.Series(data2)
d1+d2

Bengal     NaN
Delhi      NaN
Odisha    21.0
dtype: float64

# Data frame creation

In [2]:
import pandas as pd
data={"state":["Delhi(NCT)","Gujurat","Maharastra","Odisha","uttarakhand"],"CM":["Atishi Marlena","Bhupendra Patel","Eknath shinde","Mohan charan Majhi","Pushkar singh Dhami"],"pop":[4.37,10.43,13.10,5.2,3.2]}
frame=pd.DataFrame(data) # it represents a rectangular table of data
frame

         state                   CM    pop
0   Delhi(NCT)       Atishi Marlena   4.37
1      Gujurat      Bhupendra Patel  10.43
2   Maharastra        Eknath shinde  13.10
3       Odisha   Mohan charan Majhi   5.20
4  uttarakhand  Pushkar singh Dhami   3.20

In [3]:
frame.head(3)# it returns the first 3 rows

        state               CM    pop
0  Delhi(NCT)   Atishi Marlena   4.37
1     Gujurat  Bhupendra Patel  10.43
2  Maharastra    Eknath shinde  13.10

In [4]:
frame.tail(2) # it returns last 2 rows

         state                   CM  pop
3       Odisha   Mohan charan Majhi  5.2
4  uttarakhand  Pushkar singh Dhami  3.2

In [5]:
frame.head() # by default it gives first five rows

         state                   CM    pop
0   Delhi(NCT)       Atishi Marlena   4.37
1      Gujurat      Bhupendra Patel  10.43
2   Maharastra        Eknath shinde  13.10
3       Odisha   Mohan charan Majhi   5.20
4  uttarakhand  Pushkar singh Dhami   3.20

In [6]:
frame.tail()# by default it gives last five rows

         state                   CM    pop
0   Delhi(NCT)       Atishi Marlena   4.37
1      Gujurat      Bhupendra Patel  10.43
2   Maharastra        Eknath shinde  13.10
3       Odisha   Mohan charan Majhi   5.20
4  uttarakhand  Pushkar singh Dhami   3.20

In [7]:
frame.columns # it gives all the columns in the data

Index(['state', 'CM', 'pop'], dtype='object')

In [8]:
frame1=pd.DataFrame(data,columns=["CM","pop","State","Loan_amt"])
frame1.columns

Index(['CM', 'pop', 'State', 'Loan_amt'], dtype='object')

KeyError: 'State'

In [9]:
frame1.CM

0         Atishi Marlena
1        Bhupendra Patel
2          Eknath shinde
3     Mohan charan Majhi
4    Pushkar singh Dhami
Name: CM, dtype: object

In [10]:
frame1.Loan_amt

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Loan_amt, dtype: object

In [11]:
frame1['Loan_amt']=23 # here columns can be modified by assignment
frame1

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN        23
1      Bhupendra Patel  10.43   NaN        23
2        Eknath shinde  13.10   NaN        23
3   Mohan charan Majhi   5.20   NaN        23
4  Pushkar singh Dhami   3.20   NaN        23

In [12]:
frame1['Loan_amt']=[3.4,7.8,6.7,9.8,5.3] # we can pass a array for individual columns.
frame1

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN       3.4
1      Bhupendra Patel  10.43   NaN       7.8
2        Eknath shinde  13.10   NaN       6.7
3   Mohan charan Majhi   5.20   NaN       9.8
4  Pushkar singh Dhami   3.20   NaN       5.3

In [13]:
import pandas as pd
frame2=pd.DataFrame(data,columns=["CM","pop","State","Loan_amt"])
val=pd.Series([3.4,6.7,9.8],index=[0,1,3]) # here you can assign the values to specific indexes.
frame2['Loan_amt']=val
frame2

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN       3.4
1      Bhupendra Patel  10.43   NaN       6.7
2        Eknath shinde  13.10   NaN       NaN
3   Mohan charan Majhi   5.20   NaN       9.8
4  Pushkar singh Dhami   3.20   NaN       NaN

# creat a new col and deleting

In [14]:
frame1['capital']='Bhubaneswar'
frame1

                    CM    pop State  Loan_amt      capital
0       Atishi Marlena   4.37   NaN       3.4  Bhubaneswar
1      Bhupendra Patel  10.43   NaN       7.8  Bhubaneswar
2        Eknath shinde  13.10   NaN       6.7  Bhubaneswar
3   Mohan charan Majhi   5.20   NaN       9.8  Bhubaneswar
4  Pushkar singh Dhami   3.20   NaN       5.3  Bhubaneswar

In [16]:
del frame1['capital']
frame1

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN       3.4
1      Bhupendra Patel  10.43   NaN       7.8
2        Eknath shinde  13.10   NaN       6.7
3   Mohan charan Majhi   5.20   NaN       9.8
4  Pushkar singh Dhami   3.20   NaN       5.3

In [17]:
GDP={"India":{2015:2.1,2020:2.7,2025:5},"USA":{2015:18.4,2020:21.06,2025:25},"Japan":{2015:4.4,2020:5.0,2025:5.4}}
frame3=pd.DataFrame(GDP)
frame3

      India    USA  Japan
2015    2.1  18.40    4.4
2020    2.7  21.06    5.0
2025    5.0  25.00    5.4

In [19]:
x={"MS dhoni":{"Match1":25,"Match2":56,"Match3":79},"Virat":{"Match1":22,"Match2":20,"Match3":56},"Shubhman":{"Match1":56,"Match2":10,"Match3":15},"Rohit":{"Match1":52,"Match2":272,"Match3":25}}
frame4=pd.DataFrame(x)
frame4

        MS dhoni  Virat  Shubhman  Rohit
Match1        25     22        56     52
Match2        56     20        10    272
Match3        79     56        15     25

# creating DataFrame using numpy array

In [21]:
import numpy as np
a=np.array([[1,2],[3,4],[5,6]]) #not more than 2d
a=pd.DataFrame(a,index=['r1','r2','r3'],columns=['c1','c2'])#a.columns=['c1','c2']
a

    c1  c2
r1   1   2
r2   3   4
r3   5   6

In [24]:
data=[['virat',35],['Dhoni',42],['shubman',24]] # creating dataframe from list of lists
df=pd.DataFrame(data,columns=['Name','Age'])
df

      Name  Age
0    virat   35
1    Dhoni   42
2  shubman   24

In [25]:
data=[{'a':1,'b':2,'c':3},{'a':10,'b':20,'c':30,'d':7}] # creating dataframe from list of dictionary
df=pd.DataFrame(data)
df

    a   b   c    d
0   1   2   3  NaN
1  10  20  30  7.0

In [29]:
import pandas as pd
data=[{'dhoni':25,'virat':22,"shubman":56,"rohit":52},{'dhoni':23,'virat':50,"shubman":55,"rohit":54},{'dhoni':34,'virat':93,"shubman":67,"rohit":56},{'dhoni':38,'virat':90,"shubman":76,"rohit":82}]
df=pd.DataFrame(data,index=["Match1","Match2","Match3","Match4"])
df

        dhoni  virat  shubman  rohit
Match1     25     22       56     52
Match2     23     50       55     54
Match3     34     93       67     56
Match4     38     90       76     82

In [30]:
d={'one':pd.Series([10,20,30,40],index=['a','b','c','d']),'two':pd.Series([10,20,30,40],index=['a','b','c','d'])}
df=pd.DataFrame(d) # creating dataframe from dictionary of series
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

In [33]:
import pandas as pd
frame3=pd.DataFrame(GDP)
frame3.index.name='year'
frame3.columns.name='country' # naming index and columns.
frame3

country  India    USA  Japan
year
2015       2.1  18.40    4.4
2020       2.7  21.06    5.0
2025       5.0  25.00    5.4

In [34]:
df=pd.DataFrame(['a','b','c'],index=[1,2,3])
I=df.index
print(I[2])

3

In [35]:
print(I.shape)
print(I.size)
print(I.dtype)
print(I.ndim)

(3,)
3
int64
1

In [36]:
labels=pd.Index(np.arange(1,4)) # using this .index we get proprties of index explicitly.
print('labels',labels)
pd.Series([1.5,-2.5,0],index=labels)

labels Int64Index([1, 2, 3], dtype='int64')

1    1.5
2   -2.5
3    0.0
dtype: float64

# Reindexing

In [3]:
import pandas as pd
import numpy as np
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['i','ii','iii'],columns=['A','B','C'])
frame # is used to create a new object with the values

     A  B  C
i    0  1  2
ii   3  4  5
iii  6  7  8

In [4]:
frame2=frame.reindex(['i','iii','ii'])
frame2

     A  B  C
i    0  1  2
iii  6  7  8
ii   3  4  5

In [8]:
frame2=frame.reindex(index=['i','ii','iii'],columns=['B','C','A'])
frame2

     B  C  A
i    1  2  0
ii   4  5  3
iii  7  8  6

In [9]:
frame2=frame.reindex(columns=['A','B'])
frame2

     A  B
i    0  1
ii   3  4
iii  6  7

In [10]:
frame2=frame.reindex(['C','A','D','B']) # if you not pass the axis by default it takes both in row and columns.
frame2

    A   B   C
C NaN NaN NaN
A NaN NaN NaN
D NaN NaN NaN
B NaN NaN NaN

In [11]:
frame2=frame.reindex(['C','A','D','B'],axis=1) # here we pass the coulumns but all are map in row
frame2

     C  A   D  B
i    2  0 NaN  1
ii   5  3 NaN  4
iii  8  6 NaN  7

In [12]:
frame2=frame.reindex(['ii','A','D','i'],axis=0)# here we pass the row but for axis all are map in coulumn
frame2

      A    B    C
ii  3.0  4.0  5.0
A   NaN  NaN  NaN
D   NaN  NaN  NaN
i   0.0  1.0  2.0

In [13]:
frame2=frame.reindex(['ii','A','D','i'],axis=0,fill_value=7) # it will only fill the missing value
frame2

    A  B  C
ii  3  4  5
A   7  7  7
D   7  7  7
i   0  1  2

In [14]:
frame2=frame.reindex(['C','A','D','B'],axis=1,fill_value=5)
frame2

     C  A  D  B
i    2  0  5  1
ii   5  3  5  4
iii  8  6  5  7

In [15]:
frame1=pd.Series(['A','B','C'],index=[0,2,4])
frame1

0    A
2    B
4    C
dtype: object

In [16]:
frame1.reindex(np.arange(6))

0      A
1    NaN
2      B
3    NaN
4      C
5    NaN
dtype: object

In [17]:
frame1.reindex(np.arange(6),method="ffill")# here method use for filling holes in reindexed dataframe.use last valid observation to fill gap

0    A
1    A
2    B
3    B
4    C
5    C
dtype: object

In [18]:
frame1.reindex(np.arange(6),method="bfill") # use next valid observation(proper value) to fill gap

0      A
1      B
2      B
3      C
4      C
5    NaN
dtype: object

In [21]:
df=pd.DataFrame(np.arange(16).reshape((4,4)),index=['Aae','Bee','Cee','Dee'],columns=['One','Two','Three','Four'])
df

     One  Two  Three  Four
Aae    0    1      2     3
Bee    4    5      6     7
Cee    8    9     10    11
Dee   12   13     14    15

In [22]:
df.drop('Aae') # it will remove the row and column accrding to data given

     One  Two  Three  Four
Bee    4    5      6     7
Cee    8    9     10    11
Dee   12   13     14    15

In [23]:
df.drop('One')

KeyError: "['One'] not found in axis"

In [24]:
df.drop('One',axis=1)

     Two  Three  Four
Aae    1      2     3
Bee    5      6     7
Cee    9     10    11
Dee   13     14    15

In [25]:
df.drop(index=['Aae','Bee'])

     One  Two  Three  Four
Cee    8    9     10    11
Dee   12   13     14    15

In [26]:
df.drop(columns=['Two','Four'],index=['Aae'])

     One  Three
Bee    4      6
Cee    8     10
Dee   12     14

In [27]:
df.drop(columns=['Four'])

     One  Two  Three
Aae    0    1      2
Bee    4    5      6
Cee    8    9     10
Dee   12   13     14

# indexing,selection,filter in Series

In [28]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [29]:
print(obj['b'])

1.0

In [30]:
print(obj[1])

1.0

In [31]:
print(obj[2:4])

c    2.0
d    3.0
dtype: float64

In [ ]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['r1','r2','r3','r4'],columns=['c1','c2','c3','c4'])
data

In [35]:
data[(data['c3']>3) & (data['c4']>5)]

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

# loc and iloc

In [36]:
df=pd.DataFrame([[1,2],[4,5],[7,8]],index=['Cobra','Viper','RatSnake'],columns=['max_speed','length'])
df

          max_speed  length
Cobra             1       2
Viper             4       5
RatSnake          7       8

In [38]:
df.loc['Cobra'] # it returns the values of Cobra.

max_speed    1
length       2
Name: Cobra, dtype: int64

In [39]:
df.loc[['Viper','Cobra']]

       max_speed  length
Viper          4       5
Cobra          1       2

In [40]:
df.loc['Viper','length']

5

In [41]:
df.loc['Cobra':'Viper','max_speed']

Cobra    1
Viper    4
Name: max_speed, dtype: int64

In [44]:
df.loc[[False,False,True],[True,False]] # second list is refers to max_speed and length.

          max_speed
RatSnake          7

In [45]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['r1','r2','r3','r4'],columns=['c1','c2','c3','c4'])
data

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [46]:
data.iloc[0] # it will return 1st row

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int32

In [47]:
data.iloc[:,0] # it will give first columns

r1     0
r2     4
r3     8
r4    12
Name: c1, dtype: int32

In [48]:
data.iloc[[1,3]]

    c1  c2  c3  c4
r2   4   5   6   7
r4  12  13  14  15

In [49]:
data.iloc[0:2,1:3] #(row,columns)

    c2  c3
r1   1   2
r2   5   6

In [51]:
data.at['r2','c3']# here we can't use the slicing concept

6

In [52]:
data.iat[1,2]# here we can't use the slicing concept

6

# Integer indexing pitfalls

In [53]:
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [54]:
ser.iloc[-1]

2.0

In [55]:
ser[-1] #-ve index doesn't work in Series

KeyError: -1

In [56]:
ser=pd.Series(np.arange(3.),index=['a','b','c'])
ser

a    0.0
b    1.0
c    2.0
dtype: float64

In [57]:
ser[-1] # if we pass certain labels then we can do -ve indexing in both Series and iloc.

2.0

In [58]:
ser.iloc[-1]

2.0

In [59]:
ser[-2]

1.0

# Numpy ufuncs

In [63]:
df=pd.DataFrame([[4,9]]*3,columns=['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [64]:
df.apply(np.sum,axis=0) #it will add the values in columns

A    12
B    27
dtype: int64

In [65]:
df.apply(np.sum,axis=1) # it will add the values in rows

0    13
1    13
2    13
dtype: int64

In [66]:
def f1(x):
    return x.max() - x.min()
df.apply(f1,axis=1)

0    5
1    5
2    5
dtype: int64

In [67]:
def f1(x):
    return x.max() - x.min()
df.apply(f1,axis=0)

A    0
B    0
dtype: int64

In [71]:
D={'Name':['A','B','C','D'],'Reg_no':[1,2,3,4],'Sec':['i','ii','iii','iv'],'CGPA':[7,8,9,10]}
df=pd.DataFrame(D)
df.loc[df['CGPA']==np.max(df.CGPA),['Name','Reg_no']]

  Name  Reg_no
3    D       4

# Arithmetic and Data Alignment

In [3]:
import pandas as pd
import numpy as np
df1=pd.DataFrame(np.arange(12).reshape((3,4)),columns=list("abcd"))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [5]:
df2=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list("abcde"))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [6]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [9]:
df1.add(df2,fill_value=2)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   6.0
1   9.0  11.0  13.0  15.0  11.0
2  18.0  20.0  22.0  24.0  16.0
3  17.0  18.0  19.0  20.0  21.0

In [10]:
df2.loc[1,"b"]=np.nan
df1.loc[1,"b"]=np.nan

In [11]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   NaN  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [12]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250       NaN  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [13]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250       NaN  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [15]:
1/df1==df1.rdiv(1)

      a      b     c     d
0  True   True  True  True
1  True  False  True  True
2  True   True  True  True

In [16]:
df1.rdiv(2)

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50       NaN  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

In [17]:
1.div(df1)

SyntaxError: invalid syntax (3110299779.py, line 1)

# sorting

In [18]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [19]:
frame.sort_index(axis='index')

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [20]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [21]:
frame.sort_index(axis='columns',ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [25]:
obj=pd.Series([4,7,-3,2,np.nan])
obj

0    4.0
1    7.0
2   -3.0
3    2.0
4    NaN
dtype: float64

In [26]:
obj.sort_values()

2   -3.0
3    2.0
0    4.0
1    7.0
4    NaN
dtype: float64

In [27]:
obj.sort_values(na_position="first") # it will return the NaN value in first position

4    NaN
2   -3.0
3    2.0
0    4.0
1    7.0
dtype: float64

In [28]:
frame=pd.DataFrame({"a":[-4,7,3,2],"b":[0,1,0,1]})
frame

   a  b
0 -4  0
1  7  1
2  3  0
3  2  1

In [29]:
frame.sort_values("b")

   a  b
0 -4  0
2  3  0
1  7  1
3  2  1

In [30]:
frame.sort_values(["a","b"])

   a  b
0 -4  0
3  2  1
2  3  0
1  7  1

# ranking

In [35]:
obj=pd.Series([2,3,1,4])
print(obj.rank())

0    2.0
1    3.0
2    1.0
3    4.0
dtype: float64

In [32]:
obj=pd.Series([3,2,3,1]) # for repeting value it takes the mean value
print(obj.rank())

0    3.5
1    2.0
2    3.5
3    1.0
dtype: float64

In [33]:
obj=pd.Series([3,2,3,1]) 
obj.rank(method='first')

0    3.0
1    2.0
2    4.0
3    1.0
dtype: float64

In [34]:
obj.rank(ascending=False)

0    1.5
1    3.0
2    1.5
3    4.0
dtype: float64

In [39]:
 obj=pd.Series([3,2,1,2])
print(obj.rank())

0    4.0
1    2.5
2    1.0
3    2.5
dtype: float64

In [40]:
frame=pd.DataFrame({"b":[4.3,7,-3,2],"a":[0,1,0,1],"c":[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [41]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [42]:
 df=pd.DataFrame(np.random.randn(9).reshape((3,3)))
 df

          0         1         2
0  0.668633  0.088916 -0.517075
1 -0.992833  1.794428 -1.191121
2 -0.907472 -0.548473  0.653634

In [43]:
df.sum()

0   -1.231672
1    1.334871
2   -1.054562
dtype: float64

In [44]:
df.sum(axis=0)

0   -1.231672
1    1.334871
2   -1.054562
dtype: float64

In [45]:
df.sum(axis=1)

0    0.240474
1   -0.389526
2   -0.802310
dtype: float64

In [46]:
df.mean(axis=1)

0    0.080158
1   -0.129842
2   -0.267437
dtype: float64

In [48]:
df.describe()

              0         1         2
count  3.000000  3.000000  3.000000
mean  -0.410557  0.444957 -0.351521
std    0.935580  1.211350  0.933454
min   -0.992833 -0.548473 -1.191121
25%   -0.950152 -0.229778 -0.854098
50%   -0.907472  0.088916 -0.517075
75%   -0.119420  0.941672  0.068280
max    0.668633  1.794428  0.653634

In [49]:
obj=pd.DataFrame(np.random.randn(30).reshape((5,6)))
obj

          0         1         2         3         4         5
0 -0.539580  0.602964  1.658418  0.964352  0.931372 -0.961660
1 -1.735410  0.456010 -0.866262 -1.030436  0.703921 -0.688192
2  0.250641  0.318879  2.139673 -1.183328  0.222075  0.011379
3  0.335168  0.888590 -0.027802  0.734743 -0.275480  0.134713
4 -0.014891 -0.864861 -1.439052  1.185245  0.161518 -0.276803

In [50]:
obj.idxmax() # it returns by default columnwise maximum value.

0    3
1    3
2    2
3    4
4    0
5    3
dtype: int64

In [51]:
obj.idxmax(axis=1) # it return rowwise  maximum value.

0    2
1    4
2    2
3    1
4    3
dtype: int64